work/Univ/20180923_3D_sphere/result/ana001(2)/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
vertices
(
  (-0.36 -0.36 -0.36)
  (1.06 -0.36 -0.36)
  (1.06 0.36 -0.36)
  (-0.36 0.36 -0.36)
  (-0.36 -0.36 0.36)
  (1.06 -0.36 0.36)
  (1.06 0.36 0.36)
  (-0.36 0.36 0.36)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (34 18 18) simpleGrading (1 1 1)
);
defaultPatch
{
  type patch;
}
boundary ();
